SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
INNER JOIN Н_ВЕДОМОСТИ ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ВЕД_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД > 2
AND Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219;

SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД > 2;

SELECT Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_ВЕДОМОСТИ.ВЕД_ИД
FROM Н_ВЕДОМОСТИ
WHERE Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219;

-- индексы

CREATE INDEX ИНДЕКС_ТИПЫ_ВЕДОМОСТЕЙ_ИД ON Н_ТИПЫ_ВЕДОМОСТЕЙ USING BTREE("ИД");
CREATE INDEX ИНДЕКС_ВЕДОМОСТИ_ВЕД_ИД ON Н_ВЕДОМОСТИ USING BTREE("ВЕД_ИД");
CREATE INDEX ИНДЕКС_ВЕДОМОСТИ_ЧЛВК_ИД ON Н_ВЕДОМОСТИ USING BTREE("ЧЛВК_ИД");

CREATE INDEX ИНДЕКС_ТИПЫ_ВЕДОМОСТЕЙ_ИД ON Н_ТИПЫ_ВЕДОМОСТЕЙ USING BTREE("ИД");
CREATE INDEX ИНДЕКС_ВЕДОМОСТИ_ВЕД_ИД_ЧЛВК_ИД ON Н_ВЕДОМОСТИ USING BTREE("ВЕД_ИД", "ЧЛВК_ИД");

--σ(Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД > 2)

--CREATE UNIQUE INDEX idx_unique_active_email ON users (email) WHERE is_active = true;