SELECT Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИД < 100865
AND Н_ОБУЧЕНИЯ.НЗК > '001000'
AND Н_УЧЕНИКИ.ГРУППА < '5100';

select Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ИД, Н_ОБУЧЕНИЯ.НЗК FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИД > 100865;


-- индексы
CREATE INDEX ИНДЕКС_Н_ЛЮДИ_ИД ON Н_ЛЮДИ USING BTREE("ИД");
CREATE INDEX ИНДЕКС_Н_ОБУЧЕНИЯ_ЧЛВК_ИД_НЗК ON Н_ОБУЧЕНИЯ USING BTREE("ЧЛВК_ИД", "НЗК");
CREATE INDEX ИНДЕКС_Н_УЧЕНИКИ_ЧЛВК_ИД_ГРУППА ON Н_УЧЕНИКИ USING BTREE("ЧЛВК_ИД", "ГРУППА");